Revit 2027 API
Revision.RevisionDate Property
 The date of this Revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RevisionDate { get; set; }
Public Property RevisionDate As String
	Get
	Set
public:
property String^ RevisionDate {
	String^ get ();
	void set (String^ value);
}
member RevisionDate : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: This operation cannot be performed on Revisions that have already been issued.
Remarks
 The Revision date is an arbitrary String and can be blank. Revit will not attempt to interpret it as an actual date.
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace